app/controllers/flats_controller.rb

  def index
    @flats = Flat.where.not(lat: nil, lng: nil)
---
SELECT  "flats".* FROM "flats" ORDER BY "flats"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def show
    @flat = Flat.find(params[:id])
---
SELECT  "flats".* FROM "flats" WHERE "flats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]